{
  "resumen": "مجموعة عقود ذكية على السلسلة بدون إذن لتوصيل MONA للمطورين المستقلين والوكلاء، مع برك تخزين جديدة على Lens. متعملة علشان تعدّي اختبار الانسحاب.",
  "create": "اصنع",
  "manage": "أدير",
  "staking": "تخزين",
  "info": "معلومات",
  "connectWallet": "اتصل",
  "return": "رجوع",
  "walk": "استقلالية",
  "comingSoon": "قريباً",
  "globalPanel": "لوحة عالمية",
  "projects": "مشاريع",
  "epochs": "حقب",
  "wallet": "محفظة",
  "actions": "إجراءات",
  "globalPanelDesc": "الخزانة + الحقب + حالة التخفيض في إطار واحد",
  "projectsDesc": "كل المشاريع مع البيانات الوصفية والإحصائيات والاختيار",
  "epochsDesc": "سجل الحقب واللقطات العالمية",
  "walletDesc": "الأذونات والأصوات والمطالبات والمكافآت",
  "actionsDesc": "الصيانة + نقاط دخول التنفيذ",
  "global": "عالمي",
  "loadingGlobalState": "بيحمل الحالة العالمية...",
  "distribution": "التوزيع",
  "targetTotal": "الإجمالي المستهدف",
  "totalDistributed": "الإجمالي الموزع",
  "targetDuration": "المدة المستهدفة",
  "claimWindow": "نافذة المطالبة",
  "distributionStart": "بداية التوزيع",
  "budget": "الميزانية",
  "baseBudget": "الميزانية الأساسية",
  "perProjectBudget": "ميزانية كل مشروع",
  "totalDeposited": "الإجمالي المودع",
  "globalPool": "Pool عالمي",
  "totalStaked": "إجمالي الـ staking",
  "rewardNotified": "المكافأة المبلغة",
  "stakerCount": "عدد الـ stakers",
  "system": "النظام",
  "mona": "MONA",
  "registry": "السجل",
  "scorer": "المقيم",
  "slashing": "Slashing",
  "coverage": "التغطية",
  "projectsIndexed": "المشاريع المفهرسة",
  "epochsIndexed": "الحقب المفهرسة",
  "noGlobalData": "ماتلقيناش بيانات عالمية.",
  "loadingProjects": "بيحمل المشاريع...",
  "noProjectsFound": "ماتلقيناش مشاريع.",
  "untitled": "بدون عنوان",
  "projectDetail": "تفاصيل المشروع",
  "registered": "متسجل",
  "monaIn": "MONA داخل",
  "monaOut": "MONA خارج",
  "txCount": "عدد المعاملات",
  "uniqueUsers": "مستخدمين فريدين",
  "selectProjectDetail": "اختار مشروع علشان تشوف التفاصيل.",
  "loadingEpochs": "بيحمل الحقب...",
  "noEpochsFound": "ماتلقيناش حقب.",
  "epoch": "حقبة",
  "epochDetail": "تفاصيل الحقبة",
  "finalizedAt": "اتنهى في",
  "totalScore": "النتيجة الكلية",
  "activeProjects": "المشاريع النشطة",
  "selectEpochDetail": "اختار حقبة علشان تشوف التفاصيل.",
  "globalMaintenance": "الصيانة العالمية",
  "selectEpoch": "اختار حقبة",
  "project": "مشروع",
  "selectProject": "اختار مشروع",
  "useSelectedProject": "استخدم المشروع المختار",
  "reconcileTarget": "تسوية الهدف",
  "finalizeEpoch": "إنهاء الحقبة",
  "computeClaimable": "حساب القابل للمطالبة",
  "sweepExpired": "مسح المنتهية",
  "resolveSlash": "حل الـ Slash",
  "finalizeProposal": "إنهاء المقترح",
  "resolveFailure": "حل الفشل",
  "actionContext": "سياق الإجراء",
  "chain": "السلسلة",
  "selectedProject": "المشروع المختار",
  "projectAddress": "عنوان المشروع",
  "connectWalletToAct": "وصل المحفظة علشان تتصرف.",
  "walletActions": "إجراءات المحفظة",
  "voteAmount": "كمية التصويت (MONA)",
  "slashBps": "Slash BPS",
  "blacklist": "القائمة السوداء",
  "claim": "طالب",
  "vote": "صوت",
  "unvote": "الغي التصويت",
  "withdrawStake": "اسحب الـ Stake",
  "claimVoterReward": "طالب بمكافأة الناخب",
  "walletStatus": "حالة المحفظة",
  "claimer": "المطالب",
  "checking": "بيتفقد...",
  "yes": "أيوه",
  "no": "لأ",
  "raceCondition": "حالة السباق",
  "raceInfo": "مختبرين مستقلين، ووكلاء، ومدقّقين مدعوّين يراجعوا حزمة العقود الذكية بتاعة matroid قبل أي نشر على المايننت. مناطق التركيز بتشمل توزيع الخزنة، تدفّقات الستاكينج، تدفّقات السلاشينج، وسلوك الحالات الحدّية عبر دورة حياة الإيبوك بالكامل. بعد النشر، النظام بيمكّن توزيع $MONA بشكل آلي وعلى نطاق واسع عبر الشبكة، عشان كده التحقّق بيحصل قبل التفعيل.<br/><br/>فيه pool مكافأة بقيمة 25 $MONA متاح يتقسم بين المساهمين بناءً على تأثير وجودة النتائج، ومتحدد بنسبة تتناسب مع سطح التوزيع طويل المدى للنظام بعد ما يبقى شغّال.<br/><br/>خلال الفترة دي، digitalax بتكمل تطوير ganda، بتشغّل اختبارات محلية على anvil، وبتجهّز للنشر على lens testnet (chain 37111).<br/><br/>فيه التزام تشفيري بالشروط دي موجود على السلسلة: <a href=\"https://explorer.lens.xyz/tx/0x7babda26d3365a92c0db79ab61924c4e9a0d165fa033344d35eca9570aa6ce00\" class=\"underline cursor-pointer\">المعاملة هنا</a>",
  "createLogic2": "اتكلم مع آلاتك:",
  "createLogic1": "ادمج كيت Matroid مباشرة جوه مجموعة العقود الذكية بتاعة مشروعك. ابدأ على Anvil محلي أو على testnet، نظّم تدفّقات الدخول والخروج بتاعة $MONA وجرّب التكامل قبل ما حالة السباق الأولية تخلص والعقود تتفعّل على Lens mainnet. أول ما النظام يشتغل، النشاط بيتحلّ على أساس الإيبوكات إلى مكافآت متوزعة من الخزنة مقارنة بباقي المشاريع المشاركة، مع إمكانية تقسيم المكافآت بعد كده على pools عالمية وpools ستاكينج خاصة بالمشروع لحاملي $MONA وNFTs.<br/><br/>ده موجه للمصممين والمطوّرين والوكلاء اللي شغالين بالفعل جوه الماكينات والواجهات وواجهات البرمجة والعُقد. النشاط بيحصل كده كده. Matroid بتخلّي النشاط ده يطلع كحسابات، والحسابات تتحوّل لتوزيع، والتوزيع يكمّل داير من غير ما يبقى في أي مجموعة منسّقة قاعدة في النص.",
  "infoLogic": "عند إطلاق $MONA على ethereum في 2020، الإمداد الكلي اتحدد عند 10,000 توكن. تسعين في المية من الإمداد ده اتوزع مباشرة على المجتمع من خلال pools staking. عشرة في المية اتخصصت لخزانة احتياطي البروتوكول. ماكانش فيه تخصيص للفريق ولا لـ vc.<br/><br/>في 2021، اتسكت 1,300 توكن إضافية، زودت الإمداد الكلي بتلتاشر في المية لـ 11,300. نفس النمط اتطبق. عشرة في المية من الإمداد الجديد راح للخزانة، التسعين في المية الباقيين اتوزعوا من خلال pools staking متطلقة جديدة على polygon. بعد الزيادة دي، اتحط حد أقصى في العقد، منع أي سك إضافي.<br/><br/>الهيكل فضل ثابت من البداية. عشرة في المية احتياطي البروتوكول. تسعين في المية توزيع المجتمع. صفر في المية فريق أو vc.<br/><br/>من الـ 1,130 توكن المخصصين لاحتياطي البروتوكول، باقي 843 $MONA لحد يناير 2026. معظم الجزء المصروف استخدم لزرع pools سيولة على uniswap على ethereum و polygon. مراكز lp دي ماتلمستش. الباقي اتوزع من خلال مبادرات مختلفة للنظام البيئي، كلها موثقة في تقارير الشفافية الشهرية المنشورة بين 2020 و 2023.<br/><br/>بعد سنين من البناء المستمر، من التطبيقات للفصل البطيء للموضة لبنية تحتية أصلية لـ web3، البروتوكول وصل لمرحلة مختلفة. دلوقتي فيه أنظمة داخلية كفاية علشان نسأل سؤال أصعب. إزاي ده يستمر يشتغل من غيرنا.<br/><br/>مش بنسيب. لكن بيشتغل.<br/><br/>نظام محتاج فريق أساسي يفضل حي لسه هش. لو التوزيع وقف لما المهندسين يمشوا، لو المحافظ تتجمد، لو القوة تتركز افتراضياً، يبقى اللامركزية ناقصة. كل الناس في المجال ده بتفهم ده بالحدس. حتى ethereum نفسه ماوصلش للامركزية stack كامل. الوعد حقيقي، لكن لسه تحت الإنشاء.<br/><br/>ده مايعنيش الاستنى. يعني الاستمرار في الاقتراب باستبدال التقدير بالكود، التنسيق بالعقود، والنية ببنية تحتية بتشتغل في العلن.<br/><br/>ده بيرجع دور $MONA للتركيز.<br/><br/>خزانة مليانة توكنات خاملة مابتعملش كتير لوحدها. القيمة بتبدأ تهم لما بتتحرك عبر الأنظمة وبتسيب آثار الأنظمة التانية تقدر ترد عليها. التوكن بيبقى مفيد لما شغله يبقى واضح.<br/><br/>لو مش مهندس web3، بيساعد تفهم إيه erc20 فعلاً وبيعمل إيه، وإيه مش. مش عملة بتطير بين المحافظ. مافيش حاجة بتتبعت فيزيائياً أبداً.<br/><br/>$MONA هو بس عقد، أسطر كود، في الغالب ممل، لكن قوي جداً. فكر فيه كجدول. عمود واحد عناوين. التاني أرصدة. لما تحويل يحصل، العقد بيطرح رقم من صف ويضيفه لصف تاني. تغيير الحالة ده بينفذ بواسطة الشبكة، بيتكتب في بلوك، وكل عقدة بتوافق إن الجدول المحدث ده دلوقتي هو الحقيقة.<br/><br/>ده كل الآلية. مافيش كائنات بتتحرك. مافيش عملات بتسافر. بس محاسبة مشتركة، منفذة بالكود ومتزامنة عبر السلسلة.<br/><br/>في النقطة دي الناس عادة بتقول، يبقى كده البنوك بتشتغل، صح؟ نفس الحاجة زي فلوسي في حساب. أيوه، هيكلياً، هي. الفرق هو الثقة. مع البنوك، بتثق إن الأرقام بتطابق الواقع، إن الرصيد موجود، إن مافيش حاجة تانية بتحصل وراء الكواليس. التاريخ والسيد مورجان بيقترحوا العكس.<br/><br/>لما تشوف رصيد $MONA، دفتر الأستاذ ده حقيقي. لو الأرقام غلط، دفتر الأستاذ بيوريه. لو توكنات ناقصة، دفتر الأستاذ كمان بيوريه. مافيش قصة منفصلة بتحصل في مكان تاني. بسيط جداً.<br/><br/>علشان الجدول ده بيتبع صيغة قياسية، عقود تانية بتعرف تقراه وتكتب فيه. المحافظ بتعرف تعرضه. التطبيقات بتعرف تعتمد عليه. ده اللي بيخلي erc20 قوي. مش الندرة في حد ذاتها، لكن القابلية للتكوين. هو دفتر أستاذ أنظمة مستقلة كتير تقدر تتنسق حواليه من غير ما تثق في بعض.<br/><br/>$MONA بيشتغل كدفتر الأستاذ ده للنظام البيئي digitalax. التطبيقات بتسجل نشاط ضده. القيمة بتتحرك بين المشاريع من خلاله. staking والمكافآت والمطالبات كلها بتتحل رجوع لنفس سطح المحاسبة المشترك. كل الناس بتعد من نفس المكان، باستخدام نفس الوحدة، عبر نفس السلاسل، مع EVM كالمصدر المشترك للحقيقة.<br/><br/>علشان كده السؤال ده \"ليه مانستخدمش ethereum أو bitcoin بس\" بيفوت اللي بيحصل فعلاً. استخدام وحدة عالمية واحدة لكل حاجة زي محاولة عمل محاسبة في ودان كلاب أو دواليب قيادة. تقدر تعدهم، تقنياً، لكن الأرقام بتبطل تعني حاجة. السياق بينهار. الحوافز بتتشوش. الأنظمة بتبطل تصطف. وبعدين توصل للتفاصيل. عشريات. كسور. رياضيات. هل أجنحة الدعسوقة فعلاً تقدر تنقسم بنظافة لتمنتاشر خانة عشرية؟<br/><br/>الأنظمة الخاصة بالمجال محتاجة دفاتر أستاذ خاصة بالمجال. محتاجة وحدة حساب خاصة بيها علشان تفضل متماسكة ومرنة وقادرة على ضبط القابلية للتكوين من جوا النظام البيئي.<br/><br/>$MONA موجود لعمل الشغل ده. هو سطح المحاسبة الداخلي اللي بيخلي النظام البيئي ينسق، يوزع القيمة، ويستمر يشتغل مع خروج أكتر من النظام من الأيدي البشرية ودخوله في الكود.<br/><br/>لما توكن بيشتغل كدفتر أستاذ داخلي، المشكلة بتتحول من الإصدار للاستمرار. مش إزاي القيمة بتتقدم، لكن إزاي بتستمر تتكشف عبر مجال متوسع من المشاركين والتفاعلات والمشاريع، من غير الاعتماد على مجموعة مستمرة للتوسط في حركتها.<br/><br/>$MONA عدى فعلاً من مرحلة مبكرة من التوزيع القابل للبرمجة. عند الإطلاق، تسعين في المية من الإمداد اتحرر من خلال جولات staking متعددة. النهج ده ناسب لحظته. خلال صيف defi وعصور nft، staking السلبي خلق تماسك، رسخ المشاركة المبكرة، وأعطى النظام البيئي شكل أولي.<br/><br/>البيئة الحالية بتتصرف بشكل مختلف. في الظروف دي، staking السلبي بيعبر عن وجود بدل المساهمة. بيعكس فين القيمة بتستريح، مش إزاي بتيجي للوجود. لما توكن بيشتغل كسطح محاسبة مشترك، التوزيع محتاج يطلع من النشاط نفسه. القيمة المفروض تظهر من خلال التفاعل، تستمر من خلال التكرار، وتتشتت من خلال التجاور، من غير المرور ببوابات تقديرية أو تنظيم دوري.<br/><br/>ده بيمثل تحول نحو التوزيع كخاصية مستمرة للشبكة. حاجة متقدمة على مراحل، متمرنة في ظروف حية، ومسموح لها تطور موثوقية من خلال الاستخدام بدل التصميم المسبق.<br/><br/>أي مصمم أو مطور أو وكيل مستقل يقدر يدمج كيت matroid مباشرة في عقوده. لما يتدمج، تطبيقه بيوجه تدفقات $MONA الداخلة والخارجة من خلال الكيت. جوا كل حقبة، النشاط اللي بيولدوه من خلال كودهم أو منتجهم أو مجتمعهم بيتسجل on-chain جنب نشاط كل مشروع تاني مشارك.<br/><br/>النشاط ده بيتحل لتوزيع. المشاريع بتستلم $MONA من الخزانة بنسبة النشاط اللي بيساهموا بيه نسبة لغيرهم خلال نفس الحقبة. التوزيع ده تلقائي ومستمر. المشاريع كمان تقدر تظبط إزاي نصيبها بينقسم، باستخدام $MONA لتحفيز نشاط أكتر جوا نظامها البيئي الخاص من خلال تخصيص تلقائي لـ pools staking عالمية و pools staking خاصة بالمشروع. حسب الـ pool، حاملي $MONA وحاملي genesis وحاملي pode وحاملي nft الموضة كلهم يقدروا يعملوا staking، وكمان يصوتوا لقطع النشاط والمشاريع الغير متوافقة.<br/><br/>لتقديم المجموعة على مراحل، تأمين أمان العقد، والحفاظ على المرونة، التكرار الأول بينشر 50 $MONA للتوزيع على مدى نافذة مستهدفة ستة شهور. مع زيادة المشاركة ونشاط المشروع، الكمية دي تقدر تتوسع. النية طويلة المدى هي إن رصيد الخزانة الكامل يتوزع تلقائياً على مدى حوالي أربع سنين من خلال دورات النشاط المتكررة دي.<br/><br/>بسبب التطوير النشط للنظام البيئي digitalax والاستخدام الموجود على lens chain، مجموعة عقود matroid بتنتشر هناك الأول. التصميم يفضل محايد للسلسلة. مع توافق سلاسل تانية متوافقة مع evm ومفعلة بـ zk ولامركزية، النشر على مراحل بيسمح للنظام يمتد ويهاجر من غير تعطيل الهيكل الأساسي.<br/><br/>أول مشروع يدمج كيت matroid هو <a href=\"https://ganda.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">ganda</a>، ممتد من espa، حيث الألعاب والمنسوجات و web3 بيتقاطعوا. ganda بيوجه تدفقات $MONA بتاعته من خلال الكيت وبيرسخ نشاطه على lens، مع pools <a href=\"https://staking.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">staking</a> متظبطة لحاملي $MONA وحاملي nft.<br/><br/>matroids هما اللي بيخلوا الحل ده ممكن على نطاق واسع.<br/><br/>رياضياً، matroid بيحدد أي تركيبات من العناصر تقدر تتعايش من غير كسر الهيكل اللي هما ينتموا ليه. matroid هو طريقة لوصف الهيكل من خلال الاستقلال.<br/><br/>متطبق على $MONA، العناصر هي أفعال وتدفقات on-chain. الحقب بتوفر إطار زمني مشترك. مع تراكم النشاط وتداخله وإعادة تركيبه عبر المشاريع، matroid بيحافظ على شكل المساهمة علشان التوزيع يظهر من إزاي النشاط بيرتبط."
}
