{
  "resumen": "Permissionless on‑chain smart contract suite to deliver MONA to indie builders and agents, with new staking pools on Lens. Built to pass the walkaway test.",
  "create": "Create",
  "manage": "Manage",
  "staking": "Staking",
  "info": "Info",
  "connectWallet": "Connect",
  "return": "Return",
  "walk": "Walkaway",
  "comingSoon": "Coming Soon",
  "createLogic2": "Talk with your machines:",
  "createLogic1": "integrate the matroid kit directly into your project’s smart contract suite. route $MONA in and out flows, and within each epoch, resolve activity into treasury distributed rewards, relative to other participating projects. later, split onwards into global and project staking pools for $MONA and nft holders.<br/><br/>this is for designers, developers, and agents already building inside machines, interfaces, apis, and nodes. activity happens either way. matroid lets that activity surface as accounting, accounting resolve into distribution, and distribution continue to circulate without any coordinating group sitting in the middle.",
  "infoLogic": "on the launch of $MONA on ethereum in 2020, the total supply was fixed at 10,000 tokens. ninety percent of that supply was distributed directly to the community through staking pools. ten percent was allocated to a protocol reserve treasury. there was no team allocation and no vc allocation.<br/><br/>in 2021, an additional 1,300 tokens were minted, increasing the total supply by thirteen percent to 11,300. the same pattern was applied. ten percent of the new supply went to the treasury, the remaining ninety percent was distributed through newly launched staking pools on polygon. after this increase, a hard cap was set in the contract, preventing any further minting.<br/><br/>the structure has remained consistent from the start. ten percent protocol reserve. ninety percent community distribution. zero percent team or vc.<br/><br/>of the 1,130 tokens assigned to the protocol reserve, 843 $MONA remain as of january 2026. most of the spent portion was used to seed liquidity pools on uniswap across ethereum and polygon. those lp positions have not been touched. the rest was distributed through various ecosystem initiatives, all documented in the monthly transparency reports published between 2020 and 2023.<br/><br/>after years of continuous building, from applications to the slow unbundling of fashion into web3-native infrastructure, the protocol has reached a different phase. enough internal systems exist now to ask a harder question. how does this keep working without us.<br/><br/>not abandoning. but functioning.<br/><br/>a system that requires a core team to stay alive is still fragile. if distribution stops when engineers step away, if wallets freeze, if power concentrates by default, then decentralization is incomplete. everyone in this space understands this intuitively. even ethereum itself has not reached full-stack decentralization. the promise is real, but it is still under construction.<br/><br/>that does not mean waiting. it means continuing to move closer by replacing discretion with code, coordination with contracts, and intent with infrastructure that runs in the open.<br/><br/>this brings the role of $MONA back into focus.<br/><br/>a treasury full of idle tokens does not do much by itself. value starts to matter when it moves through systems and leaves traces that other systems can respond to. a token becomes useful when its job is clear.<br/><br/>if you are not a web3 engineer, it helps to understand what an erc20 actually is and does, and what it is not. it is not a coin flying around between wallets. nothing is ever physically sent.<br/><br/>$MONA is just a contract, lines of code, mostly boring, but very powerful. think of it as a table. one column is addresses. the other is balances. when a transfer happens, the contract subtracts a number from one row and adds it to another. that state change is executed by the network, written into a block, and every node agrees that this updated table is now the truth.<br/><br/>that is the whole mechanism. no objects move. no coins travel. just shared accounting, enforced by code and synchronized across the chain.<br/><br/>at this point people usually say, so this is how banks work, right. the same thing as my money in an account. yes, structurally, it is. the difference is trust. with banks, you trust that the numbers correspond to reality, that the balance is there, that nothing else is happening behind the scenes. history and mr. morgan suggest otherwise.<br/><br/>when you see a $MONA balance, that ledger is real. if the numbers are wrong, the ledger shows it. if tokens are missing, the ledger shows that too. there is no separate story happening elsewhere. very simple.<br/><br/>because that table follows a standard format, other contracts know how to read it and write to it. wallets know how to display it. applications know how to depend on it. this is what makes an erc20 powerful. not scarcity by itself, but composability. it is a ledger that many independent systems can coordinate around without trusting each other.<br/><br/>$MONA functions as that ledger for the digitalax ecosystem. applications record activity against it. value moves between projects through it. staking, rewards, and claims all resolve back to the same shared accounting surface. everyone is counting from the same place, using the same unit, across the same chains, with the EVM as the shared source of truth.<br/><br/>this is why that question “why not just use ethereum or bitcoin” misses what is actually happening. using one global unit for everything is like trying to run accounting in dog ears or steering wheels. you can count them, technically, but the numbers stop meaning anything. context collapses. incentives blur. systems stop lining up. and then you hit the details. decimals. fractions. math. can lady beetle wings really split cleanly into eighteen decimal places?<br/><br/>domain-specific systems need domain-specific ledgers. they need their own unit of account to stay coherent, flexible, and able to tune composability from inside the ecosystem.<br/><br/>$MONA exists to do that work. it is the internal accounting surface that lets the ecosystem coordinate, distribute value, and keep running as more of the system moves out of human hands and into code.<br/><br/>once a token functions as an internal ledger, the problem shifts from release to continuation. not how value is introduced, but how it keeps unfolding across an expanding field of participants, interactions, and projects, without depending on a persistent group to intermediate its movement.<br/><br/>$MONA already passed through an early phase of programmable distribution. at launch, ninety percent of the supply was released through multiple staking rounds. that approach fit its moment. during the defi summer and nft eras, passive staking created cohesion, anchored early participation, and gave the ecosystem an initial shape.<br/><br/>the present environment behaves differently. in these conditions, passive staking expresses presence rather than contribution. it reflects where value rests, not how it comes into being. once a token operates as a shared accounting surface, distribution needs to arise from activity itself. value should surface through interaction, persist through recurrence, and disperse through adjacency, without passing through discretionary gates or periodic orchestration.<br/><br/>this marks a shift toward distribution as a continuous property of the network. something introduced in stages, exercised in live conditions, and allowed to develop reliability through use rather than prior design.<br/><br/>any independent designer, developer, or agent can integrate the matroid kit directly into their contracts. once integrated, their application routes $MONA in and out flows through the kit. within each epoch, the activity they generate through their code, product, or community is recorded on-chain alongside the activity of every other participating project.<br/><br/>that activity resolves into distribution. projects receive $MONA from the treasury in proportion to the activity they contribute relative to others during the same epoch. this distribution is automatic and continuous. projects can also configure how their share is split, using $MONA to further induce activity within their own ecosystem through automated allocation to global staking pools and project-specific staking pools. depending on the pool, $MONA holders, genesis holders, pode holders, and fashion nft holders can all stake, and also vote to slash misaligned activity and projects.<br/><br/>to introduce the suite in stages, ensure contract security, and preserve flexibility, the first iteration deploys 50 $MONA for distribution over a six-month target window. as participation and project activity increase, this amount can expand. the long-term intent is for the full treasury balance to be distributed automatically over approximately four years through these recurring activity cycles.<br/><br/>because of the digitalax ecosystem’s active development and existing usage on lens chain, the matroid contract suite deploys there first. the design remains chain-agnostic. as other evm-compatible, zk-enabled, and decentralized chains align, staged deployments allow the system to extend and migrate without disrupting the underlying structure.<br/><br/>a first project to integrate the matroid kit is <a href=\"https://ganda.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">ganda</a>, extending off espa, where gaming, textiles, and web3 intersect. ganda routes its $MONA flows through the kit and anchors its activity on lens, with <a href=\"https://staking.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">staking</a> pools set up for both $MONA holders and nft holders.<br/><br/>matroids are what make this resolution possible at scale.<br/><br/>mathematically, a matroid defines which combinations of elements can coexist without breaking the structure they belong to. a matroid is a way of describing structure through independence.<br/><br/>applied to $MONA, the elements are on-chain actions and flows. epochs provide a shared temporal frame. as activity accumulates, overlaps, and recombines across projects, the matroid preserves the shape of contribution so that distribution emerges from how activity relates."
}
