{
  "resumen": "Suite de contratos inteligentes on‑chain sin permisos para entregar MONA a creadores indie y agentes, con nuevos pools de staking en Lens. Construido para superar la prueba de abandono.",
  "create": "Crear",
  "manage": "Gestionar",
  "staking": "Staking",
  "info": "Info",
  "connectWallet": "Conectar",
  "return": "Volver",
  "walk": "Autonomía",
  "comingSoon": "Próximamente",
  "globalPanel": "Panel Global",
  "projects": "Proyectos",
  "epochs": "Épocas",
  "wallet": "Cartera",
  "actions": "Acciones",
  "globalPanelDesc": "Tesoro + Épocas + Estado de slashing en un marco",
  "projectsDesc": "Todos los proyectos con metadatos, estadísticas y selección",
  "epochsDesc": "Historial de épocas e instantáneas globales",
  "walletDesc": "Permisos, votos, reclamos, recompensas",
  "actionsDesc": "Mantenimiento + puntos de entrada de ejecución",
  "global": "Global",
  "loadingGlobalState": "Cargando estado global...",
  "distribution": "Distribución",
  "targetTotal": "Total objetivo",
  "totalDistributed": "Total distribuido",
  "targetDuration": "Duración objetivo",
  "claimWindow": "Ventana de reclamo",
  "distributionStart": "Inicio de distribución",
  "budget": "Presupuesto",
  "baseBudget": "Presupuesto base",
  "perProjectBudget": "Presupuesto por proyecto",
  "totalDeposited": "Total depositado",
  "globalPool": "Pool Global",
  "totalStaked": "Total en staking",
  "rewardNotified": "Recompensa notificada",
  "stakerCount": "Cantidad de stakers",
  "system": "Sistema",
  "mona": "MONA",
  "registry": "Registro",
  "scorer": "Puntuador",
  "slashing": "Slashing",
  "coverage": "Cobertura",
  "projectsIndexed": "Proyectos indexados",
  "epochsIndexed": "Épocas indexadas",
  "noGlobalData": "No se encontraron datos globales.",
  "loadingProjects": "Cargando proyectos...",
  "noProjectsFound": "No se encontraron proyectos.",
  "untitled": "Sin título",
  "projectDetail": "Detalle del Proyecto",
  "registered": "Registrado",
  "monaIn": "MONA entrante",
  "monaOut": "MONA saliente",
  "txCount": "Cantidad de tx",
  "uniqueUsers": "Usuarios únicos",
  "selectProjectDetail": "Selecciona un proyecto para ver el detalle.",
  "loadingEpochs": "Cargando épocas...",
  "noEpochsFound": "No se encontraron épocas.",
  "epoch": "Época",
  "epochDetail": "Detalle de la Época",
  "finalizedAt": "Finalizado en",
  "totalScore": "Puntuación total",
  "activeProjects": "Proyectos activos",
  "selectEpochDetail": "Selecciona una época para ver el detalle.",
  "globalMaintenance": "Mantenimiento Global",
  "selectEpoch": "Seleccionar época",
  "project": "Proyecto",
  "selectProject": "Seleccionar proyecto",
  "useSelectedProject": "Usar proyecto seleccionado",
  "reconcileTarget": "Reconciliar Objetivo",
  "finalizeEpoch": "Finalizar Época",
  "computeClaimable": "Calcular Reclamable",
  "sweepExpired": "Barrer Expirados",
  "resolveSlash": "Resolver Slash",
  "finalizeProposal": "Finalizar Propuesta",
  "resolveFailure": "Resolver Fallo",
  "actionContext": "Contexto de Acción",
  "chain": "Cadena",
  "selectedProject": "Proyecto seleccionado",
  "projectAddress": "Dirección del proyecto",
  "connectWalletToAct": "Conecta la cartera para actuar.",
  "walletActions": "Acciones de Cartera",
  "voteAmount": "Cantidad de voto (MONA)",
  "slashBps": "Slash BPS",
  "blacklist": "Lista negra",
  "claim": "Reclamar",
  "vote": "Votar",
  "unvote": "Quitar voto",
  "withdrawStake": "Retirar Stake",
  "claimVoterReward": "Reclamar Recompensa de Votante",
  "walletStatus": "Estado de Cartera",
  "claimer": "Reclamador",
  "checking": "Verificando...",
  "yes": "Sí",
  "no": "No",
  "raceCondition": "Condición de Carrera",
  "raceInfo": "testers independientes, agentes y auditores están invitados a revisar la suite de smart contracts de matroid antes de cualquier despliegue en mainnet. las áreas de enfoque incluyen la distribución de tesorería, los flujos de staking, los flujos de slashing y el comportamiento en casos límite a lo largo de todo el ciclo de vida de cada epoch. una vez desplegado, el sistema habilita una distribución automatizada y a gran escala de $MONA en toda la red, así que la verificación ocurre antes de la activación.<br/><br/>hay un pool de recompensa de 25 $MONA disponible para dividirse entre contribuyentes según el impacto y la calidad de los hallazgos, establecido en proporción a la superficie de distribución a largo plazo del sistema una vez en vivo.<br/><br/>durante este periodo, digitalax continúa el desarrollo de ganda, ejecuta pruebas locales en anvil y prepara el despliegue a lens testnet (chain 37111).<br/><br/>existe un compromiso criptográfico de estos términos en cadena: <a href=\"https://explorer.lens.xyz/tx/0x2949e8825fc24714eaac6d9d0f2dc6f8598bea9f9f958b5a32ffaa283888ab13\" class=\"underline cursor-pointer\">AQUÍ LA TRANSACCIÓN</a>",
  "createLogic2": "Habla con tus máquinas:",
  "createLogic1": "integra el kit de Matroid directamente en el conjunto de smart contracts de tu proyecto. empieza en una instancia local de Anvil o en una testnet, enruta los flujos de entrada y salida de $MONA y prueba la integración antes de que se complete la condición inicial de carrera y los contratos se activen en Lens mainnet. una vez en producción, la actividad se resuelve por épocas en recompensas distribuidas desde la tesorería en relación con otros proyectos participantes, con recompensas que pueden dividirse opcionalmente hacia pools globales y pools de staking del proyecto para holders de $MONA y NFT.<br/><br/>esto es para diseñadores, desarrolladores y agentes que ya están construyendo dentro de máquinas, interfaces, APIs y nodos. la actividad ocurre igualmente. matroid permite que esa actividad aflore como contabilidad, que la contabilidad se resuelva en distribución y que la distribución siga circulando sin ningún grupo coordinador sentado en medio.",
  "infoLogic": "en el lanzamiento de $MONA en ethereum en 2020, el suministro total se fijó en 10,000 tokens. el noventa por ciento de ese suministro se distribuyó directamente a la comunidad a través de pools de staking. el diez por ciento se asignó a un tesoro de reserva del protocolo. no hubo asignación para el equipo ni para vc.<br/><br/>en 2021, se acuñaron 1,300 tokens adicionales, aumentando el suministro total en un trece por ciento a 11,300. se aplicó el mismo patrón. el diez por ciento del nuevo suministro fue al tesoro, el noventa por ciento restante se distribuyó a través de pools de staking recién lanzados en polygon. después de este aumento, se estableció un límite máximo en el contrato, impidiendo cualquier acuñación adicional.<br/><br/>la estructura se ha mantenido consistente desde el inicio. diez por ciento reserva del protocolo. noventa por ciento distribución comunitaria. cero por ciento equipo o vc.<br/><br/>de los 1,130 tokens asignados a la reserva del protocolo, quedan 843 $MONA a enero de 2026. la mayor parte de la porción gastada se utilizó para sembrar pools de liquidez en uniswap en ethereum y polygon. esas posiciones lp no se han tocado. el resto se distribuyó a través de varias iniciativas del ecosistema, todas documentadas en los informes mensuales de transparencia publicados entre 2020 y 2023.<br/><br/>después de años de construcción continua, desde aplicaciones hasta el lento desbundling de la moda en infraestructura nativa de web3, el protocolo ha alcanzado una fase diferente. ahora existen suficientes sistemas internos para plantear una pregunta más difícil. cómo sigue funcionando esto sin nosotros.<br/><br/>no abandonando. sino funcionando.<br/><br/>un sistema que requiere que un equipo central permanezca vivo sigue siendo frágil. si la distribución se detiene cuando los ingenieros se van, si las wallets se congelan, si el poder se concentra por defecto, entonces la descentralización está incompleta. todos en este espacio lo entienden intuitivamente. incluso ethereum mismo no ha alcanzado la descentralización de stack completo. la promesa es real, pero aún está en construcción.<br/><br/>eso no significa esperar. significa seguir acercándose reemplazando la discreción con código, la coordinación con contratos, y la intención con infraestructura que funciona en lo abierto.<br/><br/>esto trae el rol de $MONA de vuelta al foco.<br/><br/>un tesoro lleno de tokens inactivos no hace mucho por sí mismo. el valor comienza a importar cuando se mueve a través de sistemas y deja rastros a los que otros sistemas pueden responder. un token se vuelve útil cuando su trabajo está claro.<br/><br/>si no eres un ingeniero web3, ayuda entender qué es y hace realmente un erc20, y qué no es. no es una moneda volando entre wallets. nada se envía físicamente jamás.<br/><br/>$MONA es solo un contrato, líneas de código, mayormente aburrido, pero muy poderoso. piénsalo como una tabla. una columna son direcciones. la otra son balances. cuando ocurre una transferencia, el contrato resta un número de una fila y lo suma a otra. ese cambio de estado es ejecutado por la red, escrito en un bloque, y cada nodo acuerda que esta tabla actualizada es ahora la verdad.<br/><br/>ese es todo el mecanismo. ningún objeto se mueve. ninguna moneda viaja. solo contabilidad compartida, aplicada por código y sincronizada a través de la cadena.<br/><br/>en este punto la gente suele decir, entonces así funcionan los bancos, ¿verdad? lo mismo que mi dinero en una cuenta. sí, estructuralmente, lo es. la diferencia es la confianza. con los bancos, confías en que los números corresponden a la realidad, que el balance está ahí, que no está pasando nada más detrás de escena. la historia y el sr. morgan sugieren lo contrario.<br/><br/>cuando ves un balance de $MONA, ese libro mayor es real. si los números están mal, el libro mayor lo muestra. si faltan tokens, el libro mayor también lo muestra. no hay una historia separada ocurriendo en otro lugar. muy simple.<br/><br/>debido a que esa tabla sigue un formato estándar, otros contratos saben cómo leerla y escribir en ella. las wallets saben cómo mostrarla. las aplicaciones saben cómo depender de ella. esto es lo que hace poderoso a un erc20. no la escasez en sí misma, sino la componibilidad. es un libro mayor alrededor del cual muchos sistemas independientes pueden coordinarse sin confiar entre sí.<br/><br/>$MONA funciona como ese libro mayor para el ecosistema digitalax. las aplicaciones registran actividad contra él. el valor se mueve entre proyectos a través de él. staking, recompensas y reclamaciones se resuelven de vuelta a la misma superficie contable compartida. todos están contando desde el mismo lugar, usando la misma unidad, a través de las mismas cadenas, con el EVM como la fuente compartida de verdad.<br/><br/>por eso esa pregunta \"por qué no simplemente usar ethereum o bitcoin\" se pierde lo que realmente está pasando. usar una unidad global para todo es como intentar llevar contabilidad en orejas de perro o volantes. puedes contarlas, técnicamente, pero los números dejan de significar nada. el contexto colapsa. los incentivos se difuminan. los sistemas dejan de alinearse. y luego llegas a los detalles. decimales. fracciones. matemáticas. ¿pueden las alas de mariquita realmente dividirse limpiamente en dieciocho decimales?<br/><br/>los sistemas específicos de dominio necesitan libros mayores específicos de dominio. necesitan su propia unidad de cuenta para mantenerse coherentes, flexibles y capaces de ajustar la componibilidad desde dentro del ecosistema.<br/><br/>$MONA existe para hacer ese trabajo. es la superficie contable interna que permite al ecosistema coordinar, distribuir valor, y seguir funcionando a medida que más del sistema sale de las manos humanas y entra en código.<br/><br/>una vez que un token funciona como un libro mayor interno, el problema pasa de la liberación a la continuación. no cómo se introduce el valor, sino cómo sigue desplegándose a través de un campo en expansión de participantes, interacciones y proyectos, sin depender de un grupo persistente para intermediar su movimiento.<br/><br/>$MONA ya pasó por una fase temprana de distribución programable. en el lanzamiento, el noventa por ciento del suministro se liberó a través de múltiples rondas de staking. ese enfoque encajó en su momento. durante el verano defi y las eras nft, el staking pasivo creó cohesión, ancló la participación temprana, y dio al ecosistema una forma inicial.<br/><br/>el ambiente actual se comporta de manera diferente. en estas condiciones, el staking pasivo expresa presencia en lugar de contribución. refleja dónde descansa el valor, no cómo llega a ser. una vez que un token opera como una superficie contable compartida, la distribución necesita surgir de la actividad misma. el valor debería emerger a través de la interacción, persistir a través de la recurrencia, y dispersarse a través de la adyacencia, sin pasar por puertas discrecionales u orquestación periódica.<br/><br/>esto marca un cambio hacia la distribución como una propiedad continua de la red. algo introducido en etapas, ejercido en condiciones vivas, y permitido desarrollar confiabilidad a través del uso en lugar del diseño previo.<br/><br/>cualquier diseñador, desarrollador o agente independiente puede integrar el kit matroid directamente en sus contratos. una vez integrado, su aplicación enruta flujos de entrada y salida de $MONA a través del kit. dentro de cada época, la actividad que generan a través de su código, producto o comunidad se registra on-chain junto con la actividad de cada otro proyecto participante.<br/><br/>esa actividad se resuelve en distribución. los proyectos reciben $MONA del tesoro en proporción a la actividad que contribuyen en relación con otros durante la misma época. esta distribución es automática y continua. los proyectos también pueden configurar cómo se divide su parte, usando $MONA para inducir más actividad dentro de su propio ecosistema a través de asignación automatizada a pools de staking globales y pools de staking específicos del proyecto. dependiendo del pool, los holders de $MONA, holders de genesis, holders de pode y holders de nft de moda pueden todos hacer staking, y también votar para recortar actividad y proyectos desalineados.<br/><br/>para introducir el suite en etapas, asegurar la seguridad del contrato y preservar la flexibilidad, la primera iteración despliega 50 $MONA para distribución durante una ventana objetivo de seis meses. a medida que aumentan la participación y la actividad del proyecto, esta cantidad puede expandirse. la intención a largo plazo es que el balance completo del tesoro se distribuya automáticamente durante aproximadamente cuatro años a través de estos ciclos de actividad recurrentes.<br/><br/>debido al desarrollo activo del ecosistema digitalax y el uso existente en lens chain, el suite de contratos matroid se despliega allí primero. el diseño sigue siendo agnóstico de cadena. a medida que otras cadenas compatibles con evm, habilitadas con zk y descentralizadas se alinean, los despliegues por etapas permiten que el sistema se extienda y migre sin interrumpir la estructura subyacente.<br/><br/>un primer proyecto en integrar el kit matroid es <a href=\"https://ganda.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">ganda</a>, extendiéndose desde espa, donde los juegos, los textiles y web3 se intersectan. ganda enruta sus flujos de $MONA a través del kit y ancla su actividad en lens, con pools de <a href=\"https://staking.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">staking</a> configurados tanto para holders de $MONA como para holders de nft.<br/><br/>los matroids son lo que hace posible esta resolución a escala.<br/><br/>matemáticamente, un matroid define qué combinaciones de elementos pueden coexistir sin romper la estructura a la que pertenecen. un matroid es una forma de describir estructura a través de la independencia.<br/><br/>aplicado a $MONA, los elementos son acciones y flujos on-chain. las épocas proporcionan un marco temporal compartido. a medida que la actividad se acumula, se superpone y se recombina a través de proyectos, el matroid preserva la forma de la contribución para que la distribución emerja de cómo se relaciona la actividad."
}
