{
  "resumen": "Suíte de contratos inteligentes on‑chain sem permissão para entregar MONA a criadores indie e agentes, com novos pools de staking na Lens. Construído para passar no teste do abandono.",
  "create": "Criar",
  "manage": "Gerenciar",
  "staking": "Staking",
  "info": "Info",
  "connectWallet": "Conectar",
  "return": "Voltar",
  "walk": "Autonomia",
  "comingSoon": "Em Breve",
  "createLogic2": "Fale com suas máquinas:",
  "createLogic1": "integre o kit matroid diretamente no suite de contratos inteligentes do seu projeto. direcione fluxos de entrada e saída de $MONA, e dentro de cada época, resolva a atividade em recompensas distribuídas pelo tesouro, em relação a outros projetos participantes. depois, divida adiante em pools de staking globais e de projeto para holders de $MONA e nft.<br/><br/>isso é para designers, desenvolvedores e agentes que já estão construindo dentro de máquinas, interfaces, apis e nós. a atividade acontece de qualquer forma. matroid permite que essa atividade surja como contabilidade, a contabilidade se resolva em distribuição, e a distribuição continue circulando sem nenhum grupo coordenador sentado no meio.",
  "infoLogic": "no lançamento de $MONA no ethereum em 2020, o fornecimento total foi fixado em 10,000 tokens. noventa por cento desse fornecimento foi distribuído diretamente à comunidade através de pools de staking. dez por cento foi alocado para um tesouro de reserva do protocolo. não houve alocação para a equipe nem para vc.<br/><br/>em 2021, 1,300 tokens adicionais foram cunhados, aumentando o fornecimento total em treze por cento para 11,300. o mesmo padrão foi aplicado. dez por cento do novo fornecimento foi para o tesouro, os noventa por cento restantes foram distribuídos através de pools de staking recém-lançados na polygon. após esse aumento, um limite máximo foi definido no contrato, impedindo qualquer cunhagem adicional.<br/><br/>a estrutura permaneceu consistente desde o início. dez por cento reserva do protocolo. noventa por cento distribuição comunitária. zero por cento equipe ou vc.<br/><br/>dos 1,130 tokens atribuídos à reserva do protocolo, restam 843 $MONA em janeiro de 2026. a maior parte da porção gasta foi usada para semear pools de liquidez no uniswap no ethereum e polygon. essas posições lp não foram tocadas. o restante foi distribuído através de várias iniciativas do ecossistema, todas documentadas nos relatórios mensais de transparência publicados entre 2020 e 2023.<br/><br/>após anos de construção contínua, desde aplicações até o lento unbundling da moda em infraestrutura nativa de web3, o protocolo alcançou uma fase diferente. agora existem sistemas internos suficientes para fazer uma pergunta mais difícil. como isso continua funcionando sem nós.<br/><br/>não abandonando. mas funcionando.<br/><br/>um sistema que requer que uma equipe central permaneça viva ainda é frágil. se a distribuição para quando os engenheiros se afastam, se as wallets congelam, se o poder se concentra por padrão, então a descentralização está incompleta. todos neste espaço entendem isso intuitivamente. até mesmo o próprio ethereum não alcançou a descentralização de stack completo. a promessa é real, mas ainda está em construção.<br/><br/>isso não significa esperar. significa continuar se aproximando substituindo discrição por código, coordenação por contratos, e intenção por infraestrutura que funciona no aberto.<br/><br/>isso traz o papel de $MONA de volta ao foco.<br/><br/>um tesouro cheio de tokens inativos não faz muito por si mesmo. o valor começa a importar quando se move através de sistemas e deixa rastros aos quais outros sistemas podem responder. um token se torna útil quando seu trabalho está claro.<br/><br/>se você não é um engenheiro web3, ajuda entender o que um erc20 realmente é e faz, e o que não é. não é uma moeda voando entre wallets. nada é enviado fisicamente jamais.<br/><br/>$MONA é apenas um contrato, linhas de código, na maioria entediante, mas muito poderoso. pense nisso como uma tabela. uma coluna são endereços. a outra são saldos. quando uma transferência acontece, o contrato subtrai um número de uma linha e o adiciona a outra. essa mudança de estado é executada pela rede, escrita em um bloco, e cada nó concorda que esta tabela atualizada é agora a verdade.<br/><br/>esse é todo o mecanismo. nenhum objeto se move. nenhuma moeda viaja. apenas contabilidade compartilhada, aplicada por código e sincronizada através da cadeia.<br/><br/>neste ponto as pessoas geralmente dizem, então é assim que os bancos funcionam, certo? a mesma coisa que meu dinheiro em uma conta. sim, estruturalmente, é. a diferença é a confiança. com bancos, você confia que os números correspondem à realidade, que o saldo está lá, que nada mais está acontecendo nos bastidores. a história e o sr. morgan sugerem o contrário.<br/><br/>quando você vê um saldo de $MONA, esse livro-razão é real. se os números estão errados, o livro-razão mostra. se tokens estão faltando, o livro-razão também mostra. não há uma história separada acontecendo em outro lugar. muito simples.<br/><br/>porque essa tabela segue um formato padrão, outros contratos sabem como lê-la e escrever nela. wallets sabem como exibi-la. aplicações sabem como depender dela. isso é o que torna um erc20 poderoso. não a escassez em si, mas a componibilidade. é um livro-razão em torno do qual muitos sistemas independentes podem se coordenar sem confiar uns nos outros.<br/><br/>$MONA funciona como esse livro-razão para o ecossistema digitalax. aplicações registram atividade contra ele. o valor se move entre projetos através dele. staking, recompensas e reivindicações se resolvem de volta à mesma superfície contábil compartilhada. todos estão contando do mesmo lugar, usando a mesma unidade, através das mesmas cadeias, com o EVM como a fonte compartilhada de verdade.<br/><br/>é por isso que essa pergunta \"por que não apenas usar ethereum ou bitcoin\" perde o que realmente está acontecendo. usar uma unidade global para tudo é como tentar fazer contabilidade em orelhas de cachorro ou volantes. você pode contá-las, tecnicamente, mas os números param de significar nada. o contexto colapsa. os incentivos se confundem. os sistemas param de se alinhar. e então você atinge os detalhes. decimais. frações. matemática. as asas de joaninha podem realmente se dividir limpiamente em dezoito decimais?<br/><br/>sistemas específicos de domínio precisam de livros-razão específicos de domínio. eles precisam de sua própria unidade de conta para permanecer coerentes, flexíveis e capazes de ajustar a componibilidade de dentro do ecossistema.<br/><br/>$MONA existe para fazer esse trabalho. é a superfície contábil interna que permite ao ecossistema coordenar, distribuir valor, e continuar funcionando à medida que mais do sistema sai das mãos humanas e entra em código.<br/><br/>uma vez que um token funciona como um livro-razão interno, o problema muda de liberação para continuação. não como o valor é introduzido, mas como ele continua se desdobrando através de um campo em expansão de participantes, interações e projetos, sem depender de um grupo persistente para intermediar seu movimento.<br/><br/>$MONA já passou por uma fase inicial de distribuição programável. no lançamento, noventa por cento do fornecimento foi liberado através de múltiplas rodadas de staking. essa abordagem se encaixou em seu momento. durante o verão defi e as eras nft, o staking passivo criou coesão, ancorou a participação inicial, e deu ao ecossistema uma forma inicial.<br/><br/>o ambiente atual se comporta de forma diferente. nessas condições, o staking passivo expressa presença em vez de contribuição. reflete onde o valor descansa, não como ele vem a ser. uma vez que um token opera como uma superfície contábil compartilhada, a distribuição precisa surgir da própria atividade. o valor deveria surgir através da interação, persistir através da recorrência, e se dispersar através da adjacência, sem passar por portas discricionárias ou orquestração periódica.<br/><br/>isso marca uma mudança em direção à distribuição como uma propriedade contínua da rede. algo introduzido em etapas, exercido em condições vivas, e permitido desenvolver confiabilidade através do uso em vez do design prévio.<br/><br/>qualquer designer, desenvolvedor ou agente independente pode integrar o kit matroid diretamente em seus contratos. uma vez integrado, sua aplicação direciona fluxos de entrada e saída de $MONA através do kit. dentro de cada época, a atividade que eles geram através de seu código, produto ou comunidade é registrada on-chain junto com a atividade de cada outro projeto participante.<br/><br/>essa atividade se resolve em distribuição. projetos recebem $MONA do tesouro em proporção à atividade que contribuem em relação aos outros durante a mesma época. essa distribuição é automática e contínua. projetos também podem configurar como sua parte é dividida, usando $MONA para induzir mais atividade dentro de seu próprio ecossistema através de alocação automatizada para pools de staking globais e pools de staking específicos do projeto. dependendo do pool, holders de $MONA, holders de genesis, holders de pode e holders de nft de moda podem todos fazer staking, e também votar para cortar atividade e projetos desalinhados.<br/><br/>para introduzir o suite em etapas, garantir a segurança do contrato e preservar a flexibilidade, a primeira iteração implanta 50 $MONA para distribuição durante uma janela alvo de seis meses. à medida que a participação e a atividade do projeto aumentam, essa quantidade pode se expandir. a intenção de longo prazo é que o saldo completo do tesouro seja distribuído automaticamente durante aproximadamente quatro anos através desses ciclos de atividade recorrentes.<br/><br/>devido ao desenvolvimento ativo do ecossistema digitalax e uso existente na lens chain, o suite de contratos matroid é implantado lá primeiro. o design permanece agnóstico de cadeia. à medida que outras cadeias compatíveis com evm, habilitadas com zk e descentralizadas se alinham, implantações em etapas permitem que o sistema se estenda e migre sem interromper a estrutura subjacente.<br/><br/>um primeiro projeto a integrar o kit matroid é <a href=\"https://ganda.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">ganda</a>, estendendo-se do espa, onde jogos, têxteis e web3 se cruzam. ganda direciona seus fluxos de $MONA através do kit e ancora sua atividade na lens, com pools de <a href=\"https://staking.digitalax.xyz/{LANG}\" class=\"underline cursor-pointer\">staking</a> configurados tanto para holders de $MONA quanto para holders de nft.<br/><br/>matroids são o que torna essa resolução possível em escala.<br/><br/>matematicamente, um matroid define quais combinações de elementos podem coexistir sem quebrar a estrutura à qual pertencem. um matroid é uma forma de descrever estrutura através da independência.<br/><br/>aplicado a $MONA, os elementos são ações e fluxos on-chain. épocas fornecem uma estrutura temporal compartilhada. à medida que a atividade se acumula, se sobrepõe e se recombina através de projetos, o matroid preserva a forma da contribuição para que a distribuição surja de como a atividade se relaciona."
}
